# Investigation, Matching, and Formatting

## Investigation : Query and replace

### Query¶

In [1]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터를 적재합니다.
dataframe = pd.read_csv("./datasets/titanic.csv")

# 두 개의 행을 확인합니다.
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [2]:
# 첫 번째 행을 선택합니다.
dataframe.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Gender                            male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [3]:
# 세 개의 행을 선택합니다.
dataframe.iloc[1:4]

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [4]:
# 네 개의 행을 선택합니다.
dataframe.iloc[:4]

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [5]:
# 인덱스를 설정합니다.
dataframe = dataframe.set_index(dataframe['Name'])

# 행을 확인합니다.
dataframe.loc['Braund, Mr. Owen Harris']

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Gender                            male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: Braund, Mr. Owen Harris, dtype: object

In [6]:
# dataframe[:2]와 동일합니다.
dataframe[:'Braund, Mr. Owen Harris']

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [7]:
dataframe[['Age', 'Gender']].head(2)

                                                     Age  Gender
Name
Braund, Mr. Owen Harris                             22.0    male
Cumings, Mrs. John Bradley (Florence Briggs Tha...  38.0  female

In [8]:
# ‘Gender’ 열이 ‘female’인 행 중 처음 두 개를 출력합니다.
dataframe[dataframe['Gender'] == 'female'].head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [9]:
# 행을 필터링합니다.
dataframe[(dataframe['Gender'] == 'female') & (dataframe['Age'] >= 60)]

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Andrews, Miss. Kornelia Theodosia",276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.2500,D37,C
"Turkula, Mrs. (Hedwig)",484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
"Stone, Mrs. George Nelson (Martha Evelyn)",830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

### Replacing¶

In [10]:
# 값을 치환하고 두 개의 행을 출력합니다.
dataframe['Gender'].replace("female", "Woman").head(2)

Name
Braund, Mr. Owen Harris                                 male
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    Woman
Name: Gender, dtype: object

In [11]:
# "female"과 "male을 "Woman"과 "Man"으로 치환합니다.
dataframe['Gender'].replace(["female", "male"], ["Woman", "Man"]).head(5)

Name
Braund, Mr. Owen Harris                                  Man
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    Woman
Heikkinen, Miss. Laina                                 Woman
Futrelle, Mrs. Jacques Heath (Lily May Peel)           Woman
Allen, Mr. William Henry                                 Man
Name: Gender, dtype: object

In [12]:
# 값을 치환하고 두 개의 행을 출력합니다.
dataframe.replace(1, "One").head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",One,0,3,"Braund, Mr. Owen Harris",male,22.0,One,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,One,One,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,One,0,PC 17599,71.2833,C85,C

In [13]:
# 값을 치환하고 두 개의 행을 출력합니다.
dataframe.replace(r"1st", "First", regex=True).head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [14]:
# female과 male을 person으로 바꿉니다.
dataframe.replace(["female", "male"], "person").head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,"Braund, Mr. Owen Harris",person,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",person,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,"Heikkinen, Miss. Laina",person,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [15]:
# female을 1로 바꾸고 male을 0으로 바꿉니다.
dataframe.replace({"female": 1, "male": 0}).head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [16]:
# 열 이름을 바꾸고 두 개의 행을 출력합니다.
dataframe.rename(columns={'PClass': 'Passenger Class'}).head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [17]:
# 라이브러리를 임포트합니다.
import collections

# 딕셔너리를 만듭니다.
column_names = collections.defaultdict(str)

# 키를 만듭니다.
for name in dataframe.columns:
    column_names[name]

# 딕셔너리를 출력합니다.
column_names

defaultdict(str,
            {'PassengerId': '',
             'Survived': '',
             'Pclass': '',
             'Name': '',
             'Gender': '',
             'Age': '',
             'SibSp': '',
             'Parch': '',
             'Ticket': '',
             'Fare': '',
             'Cabin': '',
             'Embarked': ''})

In [18]:
# 인덱스 0을 -1로 바꿉니다.
dataframe.rename(index={0:-1}).head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [19]:
# 열 이름을 소문자로 바꿉니다.
dataframe.rename(str.lower, axis='columns').head(2)

,passengerid,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [20]:
print("내 이름은 " + "홍길동" + "입니다.")

내 이름은 홍길동입니다.

In [21]:
print("*" * 10)
n = 10
print("별표를 " + str(n) + "번 출력합니다.")
print("*" * n)

**********
별표를 10번 출력합니다.
**********

In [22]:
print("한 줄 쓰고\n그 다음 줄을 쓴다.")

한 줄 쓰고
그 다음 줄을 쓴다.

In [23]:
print("한 줄 쓰고 ", end="")
print("이어서 쓴다.")

한 줄 쓰고 이어서 쓴다.

In [24]:
name = "홍길동"
print("내 이름은 " + name + "입니다.")
mark = "$"
n = 20
print(mark + " 기호를 " + str(n) + "번 출력합니다.")
print(mark * n)

내 이름은 홍길동입니다.
$ 기호를 20번 출력합니다.
$$$$$$$$$$$$$$$$$$$$

In [25]:
print('둘리가 "호이!"하고 말했어요.')
print("둘리가 '이제 어디로 가지?'하고 생각했어요.")
# print("둘리가 "호이!"하고 말했어요")
print("둘리가 \"호이!\"하고 말했어요")

둘리가 "호이!"하고 말했어요.
둘리가 '이제 어디로 가지?'하고 생각했어요.
둘리가 "호이!"하고 말했어요

In [26]:
print("Life is short, You need Python.")
print("Life is short,\n You need Python.")
print("Pine \"Apple\"입니다.") # Pine"Apple"입니다.
print("C:\\Users\\DaeKyeong\\Desktop\\PythonWorkspace>")
print("Red Apple\rPine") # PineApple
print("Redd\bApple") # RedApple
print("Red\tApple") # Red     Apple

Life is short, You need Python.
Life is short,
 You need Python.
Pine "Apple"입니다.
C:\Users\DaeKyeong\Desktop\PythonWorkspace>
PineApple
RedApple
Red	Apple

In [27]:
multi_line_string = """
파이썬(영어: Python)은 1991년 프로그래머인 
귀도 반 로섬(Guido van Rossum)이 발표한 고급 프로그래밍 언어로,
플랫폼 독립적이며 인터프리터식, 객체지향적, 동적 타이핑(dynamically typed) 
대화형 언어이다. 파이썬이라는 이름은 귀도가 좋아하는 코미디 〈Monty Python's Flying 
Circus〉에서 따온 것이다."""

print(multi_line_string)

파이썬(영어: Python)은 1991년 프로그래머인
귀도 반 로섬(Guido van Rossum)이 발표한 고급 프로그래밍 언어로,
플랫폼 독립적이며 인터프리터식, 객체지향적, 동적 타이핑(dynamically typed)
대화형 언어이다. 파이썬이라는 이름은 귀도가 좋아하는 코미디 〈Monty Python's Flying
Circus〉에서 따온 것이다.

In [28]:
print("2023.03.01".replace(".","-"))

2023-03-01

In [29]:
print("word with space".replace(" ",""))

wordwithspace

In [30]:
python = "Life is short, You need Python."

print(python.lower()) 
print(python.upper()) 
print(python[0].isupper()) # True : 0 번째 인덱스의 값이 대문자인지 확인
print(len(python)) # 17 : 띄어쓰기를 포함한 문자열의 전체 길이 (length)
print(python.replace("Python", "Java")) 
index = python.index("n") # 처음으로 발견된 n 의 인덱스
print(index) # 5 : Python 의 n
index = python.index("n", index + 1) # 6 번째 인덱스 이후에 처음으로 발견된 n 의 인덱스 
print(index) 
find = python.find("n") # 처음으로 발견된 n 의 인덱스
print(find) # 5 : Python 의 n
find = python.find("n", find + 1) # 6 번째 인덱스 이후에 처음으로 발견된 n 의 인덱스 
print(find) 
#print(python.index("Java")) # Java 가 없기 때문에 에러가 발생하며 프로그램 종료
print(python.find("Java")) # Java 가 없으면 -1 을 반환(출력)하며 프로그램 계속 수행
print(python.count("n")) # 2 : 문자열 내에서 n 이 나온 횟수

life is short, you need python.
LIFE IS SHORT, YOU NEED PYTHON.
True
31
Life is short, You need Java.
19
29
19
29
-1
2

In [31]:
company = '삼성전자,LG전자,현대자동차,CJ,SK텔레콤'
print(company.find('전자'))
print(company.index('전자'))

2
2

In [32]:
company= '삼성전자,LG전자,현대자동차,CJ,SK텔레콤'
print(company.find('네이버'))
print(company.index('네이버'))

-1

ValueError: substring not found

In [33]:
company= '삼성전자,LG전자,현대자동차,CJ,SK텔레콤'
try:
    print(company.index('전자'))
except ValueError:
    print("-1")

2

In [34]:
company= '삼성전자,LG전자,현대자동차,CJ,SK텔레콤'
try:
    print(company.index('네이버'))
except ValueError:
    print("-1")

-1

In [35]:
company= '삼성전자,LG전자,현대자동차,CJ,SK텔레콤'
index = 0
while index > -1:
    index = company.find('전자', index)
    if index > -1:
        print(index)
        index += len('전자')

2
7

In [36]:
company= '삼성전자,LG전자,현대자동차,CJ,SK텔레콤'
index = 0
while index > -1:
    try:
        index = company.index('전자', index)
        print(index)
        index += len('전자')
    except ValueError:
        break

2
7

In [37]:
print("나는 %d살입니다." % 20) # 나는 20살입니다
print("나는 %s을 좋아합니다." % "파이썬") # 나는 파이썬을 좋아합니다.
print("Apple 은 %c로 시작해요." % "A") # Apple 은 A로 시작해요.

print("나는 %s살입니다." % 20) # 나는 20살입니다 (%s 로도 정수값 표현 가능)

print("나는 %s색과 %s색을 좋아해요." % ("파란", "빨간")) # 나는 파란색과 빨간색을 좋아해요.

나는 20살입니다.
나는 파이썬을 좋아합니다.
Apple 은 A로 시작해요.
나는 20살입니다.
나는 파란색과 빨간색을 좋아해요.

In [38]:
print("나는 {}살입니다.".format(20)) # 나는 20살입니다.
print("나는 {}색과 {}색을 좋아해요.".format("파란", "빨간")) # 나는 파란색과 빨간색을 좋아해요
print("나는 {0}색과 {1}색을 좋아해요.".format("파란", "빨간")) # 나는 파란색과 빨간색을 좋아해요
print("나는 {1}색과 {0}색을 좋아해요.".format("파란", "빨간")) # 나는 빨간색과 파란색을 좋아해요

나는 20살입니다.
나는 파란색과 빨간색을 좋아해요.
나는 파란색과 빨간색을 좋아해요.
나는 빨간색과 파란색을 좋아해요.

In [39]:
print("나는 {age}살이며, {color}색을 좋아해요.".format(age=20, color="빨간"))

print("나는 {age}살이며, {color}색을 좋아해요.".format(color="빨간", age=20))

나는 20살이며, 빨간색을 좋아해요.
나는 20살이며, 빨간색을 좋아해요.

In [40]:
age = 20
color = "빨간"
print(f"나는 {age}살이며, {color}색을 좋아해요.") # 나는 20살이며, 빨간색을 좋아해요.

나는 20살이며, 빨간색을 좋아해요.

## Q
```
다음과 같은 데이터를 정제하여

	A	B	C
0	1	1	1
1	0	0	1
2	1	1	0
3	0	0	0

아래와 같은 결과를 얻도록 하라.
0	A,B,C
1	C
2	A,B
3

In [42]:
import pandas as pd
df = pd.DataFrame([[1, 1, 1], [0, 0, 1], [1, 1, 0], [0, 0, 0]],
                  columns = ["A", "B", "C"])
df

   A  B  C
0  1  1  1
1  0  0  1
2  1  1  0
3  0  0  0

In [43]:
df2 = df.copy()
for col in df.columns:
    df2[col] = df2[col].replace(to_replace = 1, value = col)
    df2[col] = df2[col].replace(to_replace = 0, value = "")
    
df2

   A  B  C
0  A  B  C
1        C
2  A  B
3

In [44]:
"a" + "," + "b"
## a,b

",".join(["a", "b"])
## a,b

",".join(df2.iloc[0])
## 'A,B,C'

'A,B,C'

In [45]:
df2.apply(lambda x: ",".join(x), axis = 1)
## 0    A,B,C
## 1      ,,C
## 2     A,B,
## 3       ,,
## dtype: object

0    A,B,C
1      ,,C
2     A,B,
3       ,,
dtype: object

In [46]:
df.columns # 1
## Index(['A', 'B', 'C'], dtype='object')

df.columns[[True, False, True]] # 2
## Index(['A', 'C'], dtype='object')

df.columns[pd.Series([1, 0, 1]).astype("bool")] # 3
## Index(['A', 'C'], dtype='object')

Index(['A', 'C'], dtype='object')

In [47]:
df.apply(lambda x: ",".join(df.columns[x.astype("bool")]), axis = 1)
## 0    A,B,C
## 1        C
## 2      A,B
## 3         
## dtype: object

0    A,B,C
1        C
2      A,B
3
dtype: object

## Q
```
사이트 별로 비밀번호를 만들어주는 프로그램을 작성하시오.

예) http://naver.com
규칙1 : http:// 부분은 제외 → naver.com
규칙2 : 처음 만나는 점(.) 이후 부분은 제외 → naver
규칙3 : 남은 글자 중 처음 세 자리 + 글자 갯수 + 글자 내 'e'의 갯수 + '!'로 구성
                       (nav)                      (5)                   (1)             (!)

예) 생성된 비밀번호 : nav51!

프로그램을 실행했을 때 나와야 하는 출력값은 다음과 같습니다.
http://naver.com 일 때
 → nav51!
http://google.com 일 때
 → goo61!

In [48]:
URL = "http://naver.com"
# URL = "http://daum.net"
# URL = http://google.com

http_url = URL.replace("http://", "") # 규칙 1

http_url = http_url[:http_url.index(".")] # 규칙 2
# naver.com 일 때 http_url.index(".") 의 결과는 5 이므로 위 문장은
# http_url = mystr[0:5] 와 같음

http_pass = http_url[:3] + str(len(http_url)) + str(http_url.count("e")) + "!" # 규칙 3

print("{0} 의 비밀번호는 {1} 입니다.".format(URL, http_pass))

http://naver.com 의 비밀번호는 nav51! 입니다.

In [49]:
import pandas as pd
from pandas import DataFrame, Series

df2 = DataFrame(
    [
        [20180220, 1, 'OLD', 20170561, '블랙 팬서', 1339822000, 171158],
        [20180220, 2, 'OLD', 20168250, '골든슬럼버', 363771900, 48097],
        [20180220, 3, 'OLD', 20179205, '조선명탐정: 흡혈괴마의 비밀', 296896400, 40318],
        [20180220, 4, 'OLD', 20176121, '흥부: 글로 세상을 바꾼 자', 126148600, 16991],
        [20180220, 5, 'OLD', 20078561, '명탐정 코난:감벽의 관', 78434800, 11466],
        [20180220, 6, 'OLD', 20179985, '코코', 56664400, 7967],
    ],columns=['targetDt','rank','rankOldAndNew','movieCd','movieNm','salesAmt','audiCnt'])

In [50]:
print(df2.iloc[0])

targetDt           20180220
rank                      1
rankOldAndNew           OLD
movieCd            20170561
movieNm               블랙 팬서
salesAmt         1339822000
audiCnt              171158
Name: 0, dtype: object

In [51]:
print(type(df2.iloc[0]))

<class 'pandas.core.series.Series'>

In [52]:
print(df2.iloc[[0,2]])

   targetDt  rank rankOldAndNew   movieCd          movieNm    salesAmt  \
0  20180220     1           OLD  20170561            블랙 팬서  1339822000
2  20180220     3           OLD  20179205  조선명탐정: 흡혈괴마의 비밀   296896400

   audiCnt
0   171158
2    40318

In [53]:
temp = df2.loc[[False,False,True,False,False,False]] #cf) iloc: NotImplementedError: iLocation based boolean indexing on an integer type is not available 
#temp = df2.loc[df2['audiCnt'] == 40318]
print(temp)

   targetDt  rank rankOldAndNew   movieCd          movieNm   salesAmt  audiCnt
2  20180220     3           OLD  20179205  조선명탐정: 흡혈괴마의 비밀  296896400    40318

In [54]:
print(df2['audiCnt'] == 40318)

0    False
1    False
2     True
3    False
4    False
5    False
Name: audiCnt, dtype: bool

In [55]:
temp = df2.loc[df2['audiCnt'] >= 40318]
print(temp)

   targetDt  rank rankOldAndNew   movieCd          movieNm    salesAmt  \
0  20180220     1           OLD  20170561            블랙 팬서  1339822000
1  20180220     2           OLD  20168250            골든슬럼버   363771900
2  20180220     3           OLD  20179205  조선명탐정: 흡혈괴마의 비밀   296896400

   audiCnt
0   171158
1    48097
2    40318

In [56]:
temp = df2.loc[(df2['audiCnt'] >= 40318) & (df2['rank'] >= 2)]
print(temp)

   targetDt  rank rankOldAndNew   movieCd          movieNm   salesAmt  audiCnt
1  20180220     2           OLD  20168250            골든슬럼버  363771900    48097
2  20180220     3           OLD  20179205  조선명탐정: 흡혈괴마의 비밀  296896400    40318

In [57]:
print(df2.iloc[0,0]) #20180220
print(df2.iloc[0,1]) #1
print(df2.iloc[0,2]) #OLD
print(df2.iloc[0,3]) #20170561
print(df2.iloc[0,4]) #블랙 팬서
print(df2.iloc[0,5]) #1339822000
print(df2.iloc[0,6]) #171158

20180220
1
OLD
20170561
블랙 팬서
1339822000
171158

In [58]:
print(df2.iloc[-1,0]) #20180220
print(df2.iloc[-1,1]) #6
print(df2.iloc[-1,2]) #OLD
print(df2.iloc[-1,3]) #20179985
print(df2.iloc[-1,4]) #코코
print(df2.iloc[-1,5]) #56664400
print(df2.iloc[-1,6]) #7967

20180220
6
OLD
20179985
코코
56664400
7967

In [59]:
print(df2.loc[0,'targetDt']) #20180220 #df2.loc[인덱스,컬럼 이름]   
print(df2.loc[0,'rank']) #1
print(df2.loc[0,'rankOldAndNew']) #OLD
print(df2.loc[0,'movieCd']) #20170561
print(df2.loc[0,'movieNm']) #블랙 팬서
print(df2.loc[0,'salesAmt']) #1339822000
print(df2.loc[0,'audiCnt']) #171158

20180220
1
OLD
20170561
블랙 팬서
1339822000
171158

# Filtering & Sorting

In [60]:
import pandas as pd
from pandas import DataFrame, Series

df2 = DataFrame(
    [
        [20180220, 1, 'OLD', 20170561, '블랙 팬서', 1339822000, 171158],
        [20180220, 2, 'OLD', 20168250, '골든슬럼버', 363771900, 48097],
        [20180220, 3, 'OLD', 20179205, '조선명탐정: 흡혈괴마의 비밀', 296896400, 40318],
        [20180220, 4, 'OLD', 20176121, '흥부: 글로 세상을 바꾼 자', 126148600, 16991],
        [20180220, 5, 'OLD', 20078561, '명탐정 코난:감벽의 관', 78434800, 11466],
        [20180220, 6, 'OLD', 20179985, '코코', 56664400, 7967],
    ],columns=['targetDt','rank','rankOldAndNew','movieCd','movieNm','salesAmt','audiCnt'])

In [61]:
print(df2.iloc[0])

targetDt           20180220
rank                      1
rankOldAndNew           OLD
movieCd            20170561
movieNm               블랙 팬서
salesAmt         1339822000
audiCnt              171158
Name: 0, dtype: object

In [62]:
print(type(df2.iloc[0]))

<class 'pandas.core.series.Series'>

In [63]:
print(df2.iloc[[0,2]])

   targetDt  rank rankOldAndNew   movieCd          movieNm    salesAmt  \
0  20180220     1           OLD  20170561            블랙 팬서  1339822000
2  20180220     3           OLD  20179205  조선명탐정: 흡혈괴마의 비밀   296896400

   audiCnt
0   171158
2    40318

In [64]:
temp = df2.loc[[False,False,True,False,False,False]] #cf) iloc: NotImplementedError: iLocation based boolean indexing on an integer type is not available 
#temp = df2.loc[df2['audiCnt'] == 40318]
print(temp)

   targetDt  rank rankOldAndNew   movieCd          movieNm   salesAmt  audiCnt
2  20180220     3           OLD  20179205  조선명탐정: 흡혈괴마의 비밀  296896400    40318

In [65]:
print(df2['audiCnt'] == 40318)

0    False
1    False
2     True
3    False
4    False
5    False
Name: audiCnt, dtype: bool

In [66]:
temp = df2.loc[df2['audiCnt'] >= 40318]
print(temp)

   targetDt  rank rankOldAndNew   movieCd          movieNm    salesAmt  \
0  20180220     1           OLD  20170561            블랙 팬서  1339822000
1  20180220     2           OLD  20168250            골든슬럼버   363771900
2  20180220     3           OLD  20179205  조선명탐정: 흡혈괴마의 비밀   296896400

   audiCnt
0   171158
1    48097
2    40318

In [67]:
temp = df2.loc[(df2['audiCnt'] >= 40318) & (df2['rank'] >= 2)]
print(temp)

   targetDt  rank rankOldAndNew   movieCd          movieNm   salesAmt  audiCnt
1  20180220     2           OLD  20168250            골든슬럼버  363771900    48097
2  20180220     3           OLD  20179205  조선명탐정: 흡혈괴마의 비밀  296896400    40318

In [68]:
print(df2.iloc[0,0]) #20180220
print(df2.iloc[0,1]) #1
print(df2.iloc[0,2]) #OLD
print(df2.iloc[0,3]) #20170561
print(df2.iloc[0,4]) #블랙 팬서
print(df2.iloc[0,5]) #1339822000
print(df2.iloc[0,6]) #171158

20180220
1
OLD
20170561
블랙 팬서
1339822000
171158

In [69]:
print(df2.iloc[-1,0]) #20180220
print(df2.iloc[-1,1]) #6
print(df2.iloc[-1,2]) #OLD
print(df2.iloc[-1,3]) #20179985
print(df2.iloc[-1,4]) #코코
print(df2.iloc[-1,5]) #56664400
print(df2.iloc[-1,6]) #7967

20180220
6
OLD
20179985
코코
56664400
7967

In [70]:
print(df2.loc[0,'targetDt']) #20180220 #df2.loc[인덱스,컬럼 이름]   
print(df2.loc[0,'rank']) #1
print(df2.loc[0,'rankOldAndNew']) #OLD
print(df2.loc[0,'movieCd']) #20170561
print(df2.loc[0,'movieNm']) #블랙 팬서
print(df2.loc[0,'salesAmt']) #1339822000
print(df2.loc[0,'audiCnt']) #171158

20180220
1
OLD
20170561
블랙 팬서
1339822000
171158

In [71]:
import pandas as pd

##########데이터 로드

df1 = pd.DataFrame([
        ['A01', 2, 1, 60, 139, 'country', 0, 3],
        ['A02', 3, 2, 80, 148, 'country', 0, 5],
        ['A03', 3, 4, 50, 149, 'country', 0, 7],
        ['A04', 5, 5, 40, 151, 'country', 0, 10],
        ['A05', 7, 5, 35, 154, 'city', 0, 12],
        ['A06', 2, 5, 45, 149, 'country', 0, 7],
        ['A07',8, 9, 40, 155, 'city', 1, 13],
        ['A08', 9, 10, 70, 155, 'city', 3, 13],
        ['A09', 6, 12, 55, 154, 'city', 0, 12],
        ['A10', 9, 2, 40, 156, 'city', 1, 13],
        ['A11', 6, 10, 60, 153, 'city', 0, 12],
        ['A12', 2, 4, 75, 151, 'country', 0, 6]
    ], columns=['ID', 'hour', 'attendance', 'weight', 'iq', 'region', 'library', 'score'])

In [72]:
df1 = df1.rename(index={0: 'zero', 1: 'one', 2: 'two', 3: 'three', 4: 'four', 5: 'five'}) #행(row) 이름 바꾸기

print(df1.loc['zero'])
#print(df1.iloc[0])

ID                A01
hour                2
attendance          1
weight             60
iq                139
region        country
library             0
score               3
Name: zero, dtype: object

In [73]:
print(df1.loc['zero']['score']) #3
#print(df1.loc['zero', 'score']) #3

3

In [74]:
print(df1.loc[['zero', 'one']])
#print(df1.iloc[[0, 1]])

       ID  hour  attendance  weight   iq   region  library  score
zero  A01     2           1      60  139  country        0      3
one   A02     3           2      80  148  country        0      5

In [75]:
print(df1.loc['zero':'one'])

       ID  hour  attendance  weight   iq   region  library  score
zero  A01     2           1      60  139  country        0      3
one   A02     3           2      80  148  country        0      5

###==, !=, <, >, <=, >=

In [76]:
print(df1['hour'] == 5)

zero     False
one      False
two      False
three     True
four     False
five     False
6        False
7        False
8        False
9        False
10       False
11       False
Name: hour, dtype: bool

In [77]:
df_search = df1[df1['hour'] == 5]
print(df_search)

        ID  hour  attendance  weight   iq   region  library  score
three  A04     5           5      40  151  country        0     10

In [78]:
df_search = df1[df1['hour'] != 5]
print(df_search)

       ID  hour  attendance  weight   iq   region  library  score
zero  A01     2           1      60  139  country        0      3
one   A02     3           2      80  148  country        0      5
two   A03     3           4      50  149  country        0      7
four  A05     7           5      35  154     city        0     12
five  A06     2           5      45  149  country        0      7
6     A07     8           9      40  155     city        1     13
7     A08     9          10      70  155     city        3     13
8     A09     6          12      55  154     city        0     12
9     A10     9           2      40  156     city        1     13
10    A11     6          10      60  153     city        0     12
11    A12     2           4      75  151  country        0      6

In [79]:
df_search = df1[df1['hour'] <= 5]
print(df_search)

        ID  hour  attendance  weight   iq   region  library  score
zero   A01     2           1      60  139  country        0      3
one    A02     3           2      80  148  country        0      5
two    A03     3           4      50  149  country        0      7
three  A04     5           5      40  151  country        0     10
five   A06     2           5      45  149  country        0      7
11     A12     2           4      75  151  country        0      6

In [80]:
df_search = df1[df1['hour'] >= 5]
print(df_search)

        ID  hour  attendance  weight   iq   region  library  score
three  A04     5           5      40  151  country        0     10
four   A05     7           5      35  154     city        0     12
6      A07     8           9      40  155     city        1     13
7      A08     9          10      70  155     city        3     13
8      A09     6          12      55  154     city        0     12
9      A10     9           2      40  156     city        1     13
10     A11     6          10      60  153     city        0     12

In [81]:
df_search = df1[(df1['hour'] <= 5) & (df1['hour'] >= 3)]
print(df_search)

        ID  hour  attendance  weight   iq   region  library  score
one    A02     3           2      80  148  country        0      5
two    A03     3           4      50  149  country        0      7
three  A04     5           5      40  151  country        0     10

In [82]:
df_search = df1[(df1['hour'] >= 5) | (df1['hour'] <= 3)]
print(df_search)

        ID  hour  attendance  weight   iq   region  library  score
zero   A01     2           1      60  139  country        0      3
one    A02     3           2      80  148  country        0      5
two    A03     3           4      50  149  country        0      7
three  A04     5           5      40  151  country        0     10
four   A05     7           5      35  154     city        0     12
five   A06     2           5      45  149  country        0      7
6      A07     8           9      40  155     city        1     13
7      A08     9          10      70  155     city        3     13
8      A09     6          12      55  154     city        0     12
9      A10     9           2      40  156     city        1     13
10     A11     6          10      60  153     city        0     12
11     A12     2           4      75  151  country        0      6

In [83]:
df_search = df1[df1['region'] == 'city']
#df_search = df1[df1['region'].str.match('city')]
#df_search = df1[df1['region'].str.contains('it')]
#df_search = df1[df1['region'].str.startswith('ci')]
#df_search = df1[df1['region'].str.endswith('ty')]
#df_search = df1[df1['region'].str.len() == 4]
#df_search = df1[df1['region'].str.upper() == 'CITY']
#df_search = df1[df1['region'].str.lower() == 'city']
#df_search = df1[df1['region'].str.strip() == 'city']
#df_search = df1[df1['region'].str.lstrip() == 'city']
#df_search = df1[df1['region'].str.rstrip() == 'city']
print(df_search)

       ID  hour  attendance  weight   iq region  library  score
four  A05     7           5      35  154   city        0     12
6     A07     8           9      40  155   city        1     13
7     A08     9          10      70  155   city        3     13
8     A09     6          12      55  154   city        0     12
9     A10     9           2      40  156   city        1     13
10    A11     6          10      60  153   city        0     12

###isnull

In [84]:
import pandas as pd
import numpy as np

df3 = pd.DataFrame([
        [2, 1, 3],
        [np.nan, 2, 5],
        [np.nan, np.nan, 7],
        [np.nan, np.nan, 10],
        [7, 5, 12],
        [2, 5, 7],
        [8, 9, 13],
        [9, 10, 13],
        [6, 12, 12],
        [9, 2, 13],
        [np.nan, 10, 12],
        [2, 4, 6]
    ], columns=['hour', 'attendance', 'score'])

df_search = df3[df3['hour'].isnull()]
print(df_search)

    hour  attendance  score
1    NaN         2.0      5
2    NaN         NaN      7
3    NaN         NaN     10
10   NaN        10.0     12

In [85]:
df_search = df3[df3['hour'].notnull()]
#df_search = df3[~df3['hour'].isnull()]
print(df_search)

    hour  attendance  score
0    2.0         1.0      3
4    7.0         5.0     12
5    2.0         5.0      7
6    8.0         9.0     13
7    9.0        10.0     13
8    6.0        12.0     12
9    9.0         2.0     13
11   2.0         4.0      6

In [86]:
df3['hour'] = df3['hour'].fillna(5)
#df3['hour'] = df3['hour'].fillna(df3['hour'].mean())
#df3['hour'] = df3['hour'].fillna(df3['hour'].median())
#df3['hour'] = df3['hour'].fillna(df3['hour'].value_counts().index[0])

print(df3)

    hour  attendance  score
0    2.0         1.0      3
1    5.0         2.0      5
2    5.0         NaN      7
3    5.0         NaN     10
4    7.0         5.0     12
5    2.0         5.0      7
6    8.0         9.0     13
7    9.0        10.0     13
8    6.0        12.0     12
9    9.0         2.0     13
10   5.0        10.0     12
11   2.0         4.0      6

In [87]:
import pandas as pd

df1 = pd.DataFrame([
        ['A01', 2, 1, 60, 139, 'country', 0, 3],
        ['A02', 3, 2, 80, 148, 'country', 0, 5],
        ['A03', 3, 4, 50, 149, 'country', 0, 7],
        ['A04', 5, 5, 40, 151, 'country', 0, 10],
        ['A05', 7, 5, 35, 154, 'city', 0, 12],
        ['A06', 2, 5, 45, 149, 'country', 0, 7],
        ['A07',8, 9, 40, 155, 'city', 1, 13],
        ['A08', 9, 10, 70, 155, 'city', 3, 13],
        ['A09', 6, 12, 55, 154, 'city', 0, 12],
        ['A10', 9, 2, 40, 156, 'city', 1, 13],
        ['A11', 6, 10, 60, 153, 'city', 0, 12],
        ['A12', 2, 4, 75, 151, 'country', 0, 6]
    ], columns=['ID', 'hour', 'attendance', 'weight', 'iq', 'region', 'library', 'score'])

print(df1)

     ID  hour  attendance  weight   iq   region  library  score
0   A01     2           1      60  139  country        0      3
1   A02     3           2      80  148  country        0      5
2   A03     3           4      50  149  country        0      7
3   A04     5           5      40  151  country        0     10
4   A05     7           5      35  154     city        0     12
5   A06     2           5      45  149  country        0      7
6   A07     8           9      40  155     city        1     13
7   A08     9          10      70  155     city        3     13
8   A09     6          12      55  154     city        0     12
9   A10     9           2      40  156     city        1     13
10  A11     6          10      60  153     city        0     12
11  A12     2           4      75  151  country        0      6

In [88]:
print(df1.sort_values(by='hour')) #by: 정렬 기준
#print(df1.sort_values(by=['hour']))

     ID  hour  attendance  weight   iq   region  library  score
0   A01     2           1      60  139  country        0      3
5   A06     2           5      45  149  country        0      7
11  A12     2           4      75  151  country        0      6
1   A02     3           2      80  148  country        0      5
2   A03     3           4      50  149  country        0      7
3   A04     5           5      40  151  country        0     10
8   A09     6          12      55  154     city        0     12
10  A11     6          10      60  153     city        0     12
4   A05     7           5      35  154     city        0     12
6   A07     8           9      40  155     city        1     13
7   A08     9          10      70  155     city        3     13
9   A10     9           2      40  156     city        1     13

In [89]:
print(df1.sort_values(by=['hour', 'attendance']))

     ID  hour  attendance  weight   iq   region  library  score
0   A01     2           1      60  139  country        0      3
11  A12     2           4      75  151  country        0      6
5   A06     2           5      45  149  country        0      7
1   A02     3           2      80  148  country        0      5
2   A03     3           4      50  149  country        0      7
3   A04     5           5      40  151  country        0     10
10  A11     6          10      60  153     city        0     12
8   A09     6          12      55  154     city        0     12
4   A05     7           5      35  154     city        0     12
6   A07     8           9      40  155     city        1     13
9   A10     9           2      40  156     city        1     13
7   A08     9          10      70  155     city        3     13

In [90]:
print(df1.sort_values(by='hour', ascending=False)) #내림 차순 정렬
#print(df1.sort_values(by=['hour'], ascending=False))

     ID  hour  attendance  weight   iq   region  library  score
7   A08     9          10      70  155     city        3     13
9   A10     9           2      40  156     city        1     13
6   A07     8           9      40  155     city        1     13
4   A05     7           5      35  154     city        0     12
8   A09     6          12      55  154     city        0     12
10  A11     6          10      60  153     city        0     12
3   A04     5           5      40  151  country        0     10
1   A02     3           2      80  148  country        0      5
2   A03     3           4      50  149  country        0      7
0   A01     2           1      60  139  country        0      3
5   A06     2           5      45  149  country        0      7
11  A12     2           4      75  151  country        0      6

In [91]:
print(df1.sort_values(by=['hour', 'attendance'], ascending=False))

     ID  hour  attendance  weight   iq   region  library  score
7   A08     9          10      70  155     city        3     13
9   A10     9           2      40  156     city        1     13
6   A07     8           9      40  155     city        1     13
4   A05     7           5      35  154     city        0     12
8   A09     6          12      55  154     city        0     12
10  A11     6          10      60  153     city        0     12
3   A04     5           5      40  151  country        0     10
2   A03     3           4      50  149  country        0      7
1   A02     3           2      80  148  country        0      5
5   A06     2           5      45  149  country        0      7
11  A12     2           4      75  151  country        0      6
0   A01     2           1      60  139  country        0      3

In [92]:
print(df1['hour'].sort_values())

0     2
5     2
11    2
1     3
2     3
3     5
8     6
10    6
4     7
6     8
7     9
9     9
Name: hour, dtype: int64

In [93]:
print(df1['hour'].sort_values(ascending=False))

7     9
9     9
6     8
4     7
8     6
10    6
3     5
1     3
2     3
0     2
5     2
11    2
Name: hour, dtype: int64

In [94]:
df1 = df1.reset_index()
print(df1)

    index   ID  hour  attendance  weight   iq   region  library  score
0       0  A01     2           1      60  139  country        0      3
1       1  A02     3           2      80  148  country        0      5
2       2  A03     3           4      50  149  country        0      7
3       3  A04     5           5      40  151  country        0     10
4       4  A05     7           5      35  154     city        0     12
5       5  A06     2           5      45  149  country        0      7
6       6  A07     8           9      40  155     city        1     13
7       7  A08     9          10      70  155     city        3     13
8       8  A09     6          12      55  154     city        0     12
9       9  A10     9           2      40  156     city        1     13
10     10  A11     6          10      60  153     city        0     12
11     11  A12     2           4      75  151  country        0      6

In [95]:
df1 = df1.drop(columns=['index'])
print(df1)

     ID  hour  attendance  weight   iq   region  library  score
0   A01     2           1      60  139  country        0      3
1   A02     3           2      80  148  country        0      5
2   A03     3           4      50  149  country        0      7
3   A04     5           5      40  151  country        0     10
4   A05     7           5      35  154     city        0     12
5   A06     2           5      45  149  country        0      7
6   A07     8           9      40  155     city        1     13
7   A08     9          10      70  155     city        3     13
8   A09     6          12      55  154     city        0     12
9   A10     9           2      40  156     city        1     13
10  A11     6          10      60  153     city        0     12
11  A12     2           4      75  151  country        0      6

In [96]:
df1 = df1.reset_index(drop=False)
print(df1)

    index   ID  hour  attendance  weight   iq   region  library  score
0       0  A01     2           1      60  139  country        0      3
1       1  A02     3           2      80  148  country        0      5
2       2  A03     3           4      50  149  country        0      7
3       3  A04     5           5      40  151  country        0     10
4       4  A05     7           5      35  154     city        0     12
5       5  A06     2           5      45  149  country        0      7
6       6  A07     8           9      40  155     city        1     13
7       7  A08     9          10      70  155     city        3     13
8       8  A09     6          12      55  154     city        0     12
9       9  A10     9           2      40  156     city        1     13
10     10  A11     6          10      60  153     city        0     12
11     11  A12     2           4      75  151  country        0      6

In [97]:
import pandas as pd

features = ['hour', 'attendance']
importances = [1, 0]

s = pd.Series(
    importances,
    index=features
)
print(s)

hour          1
attendance    0
dtype: int64

In [98]:
s = s.sort_values(ascending=False)
print(s)

hour          1
attendance    0
dtype: int64

###페어 정렬 (데이터 프레임 sort_values 메서드)

In [99]:
import pandas as pd

features = ['hour', 'attendance']
importances = [1, 0]

df = pd.DataFrame({
    'features': features,
    'importances': importances
})
print(df)

     features  importances
0        hour            1
1  attendance            0

In [100]:
df = df.sort_values('importances', ascending=False)
print(df)

     features  importances
0        hour            1
1  attendance            0

In [101]:
import pandas as pd

df4 = pd.DataFrame([
        ['A01', 2, 1, 60, 139, 'country', 0, 3, 3],
        ['A02', 3, 2, 80, 148, 'country', 0, 6, 4],
        ['A03', 3, 4, 50, 149, 'country', 0, 6, 8],
        ['A04', 5, 5, 40, 151, 'country', 0, 9, 11],
        ['A05', 7, 5, 35, 154, 'city', 0, 13, 11],
        ['A06', 2, 5, 45, 149, 'country', 0, 8, 6],
        ['A07',8, 9, 40, 155, 'city', 1, 14, 12],
        ['A08', 9, 10, 70, 155, 'city', 3, 12, 14],
        ['A09', 6, 12, 55, 154, 'city', 0, 11, 13],
        ['A10', 9, 2, 40, 156, 'city', 1, 14, 12],
        ['A11', 6, 10, 60, 153, 'city', 0, 11, 13],
        ['A12', 2, 4, 75, 151, 'country', 0, 5, 7]
    ], columns=['ID', 'hour', 'attendance', 'weight', 'iq', 'region', 'library', 'english_score', 'math_score'])

df4['english_score'] = 0
#df4['english_score'] = [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

print(df4)

     ID  hour  attendance  weight   iq   region  library  english_score  \
0   A01     2           1      60  139  country        0              0
1   A02     3           2      80  148  country        0              0
2   A03     3           4      50  149  country        0              0
3   A04     5           5      40  151  country        0              0
4   A05     7           5      35  154     city        0              0
5   A06     2           5      45  149  country        0              0
6   A07     8           9      40  155     city        1              0
7   A08     9          10      70  155     city        3              0
8   A09     6          12      55  154     city        0              0
9   A10     9           2      40  156     city        1              0
10  A11     6          10      60  153     city        0              0
11  A12     2           4      75  151  country        0              0

    math_score
0            3
1            4
2            8
3           11
4           11
5            6
6           12
7           14
8           13
9           12
10          13
11           7

In [102]:
df4['english_score'] = df4['english_score'] / 2

print(df4)

     ID  hour  attendance  weight   iq   region  library  english_score  \
0   A01     2           1      60  139  country        0            0.0
1   A02     3           2      80  148  country        0            0.0
2   A03     3           4      50  149  country        0            0.0
3   A04     5           5      40  151  country        0            0.0
4   A05     7           5      35  154     city        0            0.0
5   A06     2           5      45  149  country        0            0.0
6   A07     8           9      40  155     city        1            0.0
7   A08     9          10      70  155     city        3            0.0
8   A09     6          12      55  154     city        0            0.0
9   A10     9           2      40  156     city        1            0.0
10  A11     6          10      60  153     city        0            0.0
11  A12     2           4      75  151  country        0            0.0

    math_score
0            3
1            4
2            8
3           11
4           11
5            6
6           12
7           14
8           13
9           12
10          13
11           7

In [103]:

df4.loc[0] = ['A13', 2, 5, 76, 153, 'country', 0, 6, 8]

print(df4)

     ID  hour  attendance  weight   iq   region  library  english_score  \
0   A13     2           5      76  153  country        0            6.0
1   A02     3           2      80  148  country        0            0.0
2   A03     3           4      50  149  country        0            0.0
3   A04     5           5      40  151  country        0            0.0
4   A05     7           5      35  154     city        0            0.0
5   A06     2           5      45  149  country        0            0.0
6   A07     8           9      40  155     city        1            0.0
7   A08     9          10      70  155     city        3            0.0
8   A09     6          12      55  154     city        0            0.0
9   A10     9           2      40  156     city        1            0.0
10  A11     6          10      60  153     city        0            0.0
11  A12     2           4      75  151  country        0            0.0

    math_score
0            8
1            4
2            8
3           11
4           11
5            6
6           12
7           14
8           13
9           12
10          13
11           7

In [104]:
import pandas as pd

df4 = pd.DataFrame([
        ['A01', 2, 1, 60, 139, 'country', 0, 3, 3],
        ['A02', 3, 2, 80, 148, 'country', 0, 6, 4],
        ['A03', 3, 4, 50, 149, 'country', 0, 6, 8],
        ['A04', 5, 5, 40, 151, 'country', 0, 9, 11],
        ['A05', 7, 5, 35, 154, 'city', 0, 13, 11],
        ['A06', 2, 5, 45, 149, 'country', 0, 8, 6],
        ['A07',8, 9, 40, 155, 'city', 1, 14, 12],
        ['A08', 9, 10, 70, 155, 'city', 3, 12, 14],
        ['A09', 6, 12, 55, 154, 'city', 0, 11, 13],
        ['A10', 9, 2, 40, 156, 'city', 1, 14, 12],
        ['A11', 6, 10, 60, 153, 'city', 0, 11, 13],
        ['A12', 2, 4, 75, 151, 'country', 0, 5, 7]
    ], columns=['ID', 'hour', 'attendance', 'weight', 'iq', 'region', 'library', 'english_score', 'math_score'])

In [105]:
df4 = df4.drop(columns='ID')
#df4 = df4.drop(columns=['ID'])
#df4.drop(columns=['ID'], inplace=True)
print(df4)

    hour  attendance  weight   iq   region  library  english_score  math_score
0      2           1      60  139  country        0              3           3
1      3           2      80  148  country        0              6           4
2      3           4      50  149  country        0              6           8
3      5           5      40  151  country        0              9          11
4      7           5      35  154     city        0             13          11
5      2           5      45  149  country        0              8           6
6      8           9      40  155     city        1             14          12
7      9          10      70  155     city        3             12          14
8      6          12      55  154     city        0             11          13
9      9           2      40  156     city        1             14          12
10     6          10      60  153     city        0             11          13
11     2           4      75  151  country        0              5           7

In [106]:
import pandas as pd

df4 = pd.DataFrame([
        ['A01', 2, 1, 60, 139, 'country', 0, 3, 3],
        ['A02', 3, 2, 80, 148, 'country', 0, 6, 4],
        ['A03', 3, 4, 50, 149, 'country', 0, 6, 8],
        ['A04', 5, 5, 40, 151, 'country', 0, 9, 11],
        ['A05', 7, 5, 35, 154, 'city', 0, 13, 11],
        ['A06', 2, 5, 45, 149, 'country', 0, 8, 6],
        ['A07',8, 9, 40, 155, 'city', 1, 14, 12],
        ['A08', 9, 10, 70, 155, 'city', 3, 12, 14],
        ['A09', 6, 12, 55, 154, 'city', 0, 11, 13],
        ['A10', 9, 2, 40, 156, 'city', 1, 14, 12],
        ['A11', 6, 10, 60, 153, 'city', 0, 11, 13],
        ['A12', 2, 4, 75, 151, 'country', 0, 5, 7]
    ], columns=['ID', 'hour', 'attendance', 'weight', 'iq', 'region', 'library', 'english_score', 'math_score'])

In [107]:
df4 = df4.drop(index=0)
#df4 = df4.drop(index=[0])
#df4.drop(index=[0], inplace=True)
print(df4)

     ID  hour  attendance  weight   iq   region  library  english_score  \
1   A02     3           2      80  148  country        0              6
2   A03     3           4      50  149  country        0              6
3   A04     5           5      40  151  country        0              9
4   A05     7           5      35  154     city        0             13
5   A06     2           5      45  149  country        0              8
6   A07     8           9      40  155     city        1             14
7   A08     9          10      70  155     city        3             12
8   A09     6          12      55  154     city        0             11
9   A10     9           2      40  156     city        1             14
10  A11     6          10      60  153     city        0             11
11  A12     2           4      75  151  country        0              5

    math_score
1            4
2            8
3           11
4           11
5            6
6           12
7           14
8           13
9           12
10          13
11           7

In [108]:
import pandas as pd

df4 = pd.DataFrame([
        ['A01', 2, 1, 60, 139, 'country', 0, 3, 3],
        ['A02', 3, 2, 80, 148, 'country', 0, 6, 4],
        ['A03', 3, 4, 50, 149, 'country', 0, 6, 8],
        ['A04', 5, 5, 40, 151, 'country', 0, 9, 11],
        ['A05', 7, 5, 35, 154, 'city', 0, 13, 11],
        ['A06', 2, 5, 45, 149, 'country', 0, 8, 6],
        ['A07',8, 9, 40, 155, 'city', 1, 14, 12],
        ['A08', 9, 10, 70, 155, 'city', 3, 12, 14],
        ['A09', 6, 12, 55, 154, 'city', 0, 11, 13],
        ['A10', 9, 2, 40, 156, 'city', 1, 14, 12],
        ['A11', 6, 10, 60, 153, 'city', 0, 11, 13],
        ['A12', 2, 4, 75, 151, 'country', 0, 5, 7]
    ], columns=['ID', 'hour', 'attendance', 'weight', 'iq', 'region', 'library', 'english_score', 'math_score'])

In [109]:
df4 = df4.drop(index=df4.index)
#df4.drop(index=df4.index, inplace=True)
print(df4)

Empty DataFrame
Columns: [ID, hour, attendance, weight, iq, region, library, english_score, math_score]
Index: []

Attention

식당데이터 : justmarkham/DAT8
DataUrl = ‘https://raw.githubusercontent.com/kznetwork/DataAnalysis/main/datasets/chipo.csv’

## Question 20

데이터를 로드하라.

In [110]:
import pandas as pd

DataUrl = 'https://raw.githubusercontent.com/kznetwork/DataAnalysis/main/datasets/chipo.csv'
df = pd.read_csv(DataUrl)
df

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [111]:
Ans = type(df)
Ans

pandas.core.frame.DataFrame

## Question 21

quantity컬럼 값이 3인 데이터를 추출하여 첫 5행을 출력하라

In [112]:
Ans = df.loc[df['quantity']==3].head()
Ans

,order_id,quantity,item_name,choice_description,item_price
409,178,3,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$32.94
445,193,3,Bowl,"[Braised Carnitas, Pinto Beans, [Sour Cream, C...",$22.20
689,284,3,Canned Soft Drink,[Diet Coke],$3.75
818,338,3,Bottled Water,NaN,$3.27
850,350,3,Canned Soft Drink,[Sprite],$3.75

## Question 22

quantity컬럼 값이 3인 데이터를 추출하여 index를 0부터 정렬하고 첫 5행을 출력하라

In [113]:
df['quantity']==3

0       False
1       False
2       False
3       False
4       False
        ...
4617    False
4618    False
4619    False
4620    False
4621    False
Name: quantity, Length: 4622, dtype: bool

In [114]:
[df['quantity']==3]

[0       False
 1       False
 2       False
 3       False
 4       False
         ...
 4617    False
 4618    False
 4619    False
 4620    False
 4621    False
 Name: quantity, Length: 4622, dtype: bool]

In [115]:
df.loc[df['quantity']==3].head()

,order_id,quantity,item_name,choice_description,item_price
409,178,3,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$32.94
445,193,3,Bowl,"[Braised Carnitas, Pinto Beans, [Sour Cream, C...",$22.20
689,284,3,Canned Soft Drink,[Diet Coke],$3.75
818,338,3,Bottled Water,NaN,$3.27
850,350,3,Canned Soft Drink,[Sprite],$3.75

In [116]:
df.loc[df['quantity']==3].head().reset_index()

,index,order_id,quantity,item_name,choice_description,item_price
0,409,178,3,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$32.94
1,445,193,3,Bowl,"[Braised Carnitas, Pinto Beans, [Sour Cream, C...",$22.20
2,689,284,3,Canned Soft Drink,[Diet Coke],$3.75
3,818,338,3,Bottled Water,NaN,$3.27
4,850,350,3,Canned Soft Drink,[Sprite],$3.75

In [117]:
Ans = df.loc[df['quantity']==3].head().reset_index(drop=True)
Ans

,order_id,quantity,item_name,choice_description,item_price
0,178,3,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$32.94
1,193,3,Bowl,"[Braised Carnitas, Pinto Beans, [Sour Cream, C...",$22.20
2,284,3,Canned Soft Drink,[Diet Coke],$3.75
3,338,3,Bottled Water,NaN,$3.27
4,350,3,Canned Soft Drink,[Sprite],$3.75

## Question 23

quantity , item_price 두개의 컬럼으로 구성된 새로운 데이터 프레임을 정의하라

In [118]:
Ans =df[['quantity','item_price']].copy()
Ans

      quantity item_price
0            1     $2.39
1            1     $3.39
2            1     $3.39
3            1     $2.39
4            2    $16.98
...        ...        ...
4617         1    $11.75
4618         1    $11.75
4619         1    $11.25
4620         1     $8.75
4621         1     $8.75

[4622 rows x 2 columns]

## Question 24

item_price 컬럼의 달러표시 문자를 제거하고 float 타입으로 저장하여 new_price 컬럼에 저장하라

In [119]:
A = '$123.23'
A.replace('$','')

'123.23'

In [120]:
df['item_price'].str.replace('$','',regex=False) #$가 정규표현식일 수 있음

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
         ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: object

In [121]:
df['new_price'] = df['item_price'].str[1:].astype('float')
Ans = df['new_price'].head()
Ans

0     2.39
1     3.39
2     3.39
3     2.39
4    16.98
Name: new_price, dtype: float64

## Question 25

new_price 컬럼이 5이하의 값을 가지는 데이터프레임을 추출하고, 전체 갯수를 구하여라

In [122]:
Ans = len(df.loc[df.new_price <=5])
Ans

1652

## Question 26

item_name명이 Chicken Salad Bowl 인 데이터 프레임을 추출하라고 index 값을 초기화 하여라

In [123]:
Ans = df.loc[df.item_name =='Chicken Salad Bowl'].reset_index(drop=True)
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
0,20,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75
1,60,2,Chicken Salad Bowl,"[Tomatillo Green Chili Salsa, [Sour Cream, Che...",$22.50,22.50
2,94,2,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$22.50,22.50
3,111,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$8.75,8.75
4,137,2,Chicken Salad Bowl,"[Fresh Tomato Salsa, Fajita Vegetables]",$17.50,17.50
...,...,...,...,...,...,...
105,1813,2,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$17.50,17.50
106,1822,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Black Beans, Cheese, Gua...",$11.25,11.25
107,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25,11.25
108,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,8.75
109,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75

## Question 27

new_price값이 9 이하이고 item_name 값이 Chicken Salad Bowl 인 데이터 프레임을 추출하라

In [124]:
Ans = df.loc[(df.item_name =='Chicken Salad Bowl') & (df.new_price <= 9)]
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
44,20,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75
256,111,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$8.75,8.75
526,220,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Black Beans, Sour ...",$8.75,8.75
528,221,1,Chicken Salad Bowl,"[Tomatillo Green Chili Salsa, [Fajita Vegetabl...",$8.75,8.75
529,221,1,Chicken Salad Bowl,"[Tomatillo Green Chili Salsa, [Fajita Vegetabl...",$8.75,8.75
568,234,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, Fajita Vegetables]",$8.75,8.75
585,240,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, Fajita Vegetables]",$8.75,8.75
693,286,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Sour Cream, Cheese, Lett...",$8.75,8.75
702,289,1,Chicken Salad Bowl,"[Tomatillo Red Chili Salsa, [Black Beans, Chee...",$8.75,8.75
762,314,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,8.75
1109,458,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$8.75,8.75
1460,592,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, Lettuce]",$8.75,8.75
1471,598,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75,8.75
1483,602,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Chees...",$8.75,8.75
1547,628,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$8.75,8.75
1601,649,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75,8.75
1621,654,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75,8.75
1756,709,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Sour ...",$8.75,8.75
1977,798,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Sour ...",$8.75,8.75
2031,818,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",$8.75,8.75
2113,850,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Cheese]]",$8.75,8.75
2224,896,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Pinto Beans, Sour Cream,...",$8.75,8.75
2314,926,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Rice, Sour Cream]]",$8.75,8.75
2728,1083,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Cheese, Lettuce]]",$8.75,8.75
2858,1136,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Chees...",$8.75,8.75
2883,1145,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Black Beans, Sour ...",$8.75,8.75
2897,1152,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, Cheese]",$8.75,8.75
2989,1189,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$8.75,8.75
3033,1206,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Cheese, Lettuce]]",$8.75,8.75
3069,1222,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Black...",$8.75,8.75
3117,1243,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Rice, Pinto Beans,...",$8.75,8.75
3259,1305,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75
3261,1305,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,8.75
3310,1327,1,Chicken Salad Bowl,[Fresh Tomato Salsa],$8.75,8.75
3315,1329,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Rice, Lettuce]]",$8.75,8.75
3381,1357,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Cheese, Lettuce]]",$8.75,8.75
3411,1368,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Pinto Beans, Lettuce]]",$8.75,8.75
3623,1450,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Rice, Pinto Beans,...",$8.75,8.75
3656,1461,1,Chicken Salad Bowl,"[Tomatillo Green Chili Salsa, [Fajita Vegetabl...",$8.75,8.75
3706,1483,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Pinto Beans, Chees...",$8.75,8.75
3712,1483,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Black Beans, Chees...",$8.75,8.75
3790,1517,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Chees...",$8.75,8.75
3798,1521,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,8.75
3974,1592,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Rice, Pinto Beans, Lettu...",$8.75,8.75
3997,1601,1,Chicken Salad Bowl,"[Tomatillo Green Chili Salsa, [Fajita Vegetabl...",$8.75,8.75
4012,1606,1,Chicken Salad Bowl,[Fresh Tomato Salsa],$8.75,8.75
4035,1615,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Chees...",$8.75,8.75
4064,1627,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$8.75,8.75
4205,1679,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Black Beans, Chees...",$8.75,8.75
4207,1679,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Black Beans, Cheese, Sou...",$8.75,8.75
4333,1730,1,Chicken Salad Bowl,"[Tomatillo Red Chili Salsa, [Rice, Cheese]]",$8.75,8.75
4352,1738,1,Chicken Salad Bowl,"[Tomatillo Red Chili Salsa, [Rice, Fajita Vege...",$8.75,8.75
4439,1769,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$8.75,8.75
4520,1797,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, Lettuce]",$8.75,8.75
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75

## Question 28

df의 new_price 컬럼 값에 따라 오름차순으로 정리하고 index를 초기화 하여라

In [125]:
Ans = df.sort_values('new_price').reset_index(drop=True)
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
0,471,1,Bottled Water,NaN,$1.09,1.09
1,338,1,Canned Soda,[Coca Cola],$1.09,1.09
2,1575,1,Canned Soda,[Dr. Pepper],$1.09,1.09
3,47,1,Canned Soda,[Dr. Pepper],$1.09,1.09
4,1014,1,Canned Soda,[Coca Cola],$1.09,1.09
...,...,...,...,...,...,...
4617,1443,3,Veggie Burrito,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$33.75,33.75
4618,1443,4,Chicken Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$35.00,35.00
4619,511,4,Chicken Burrito,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$35.00,35.00
4620,1398,3,Carnitas Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$35.25,35.25
4621,1443,15,Chips and Fresh Tomato Salsa,NaN,$44.25,44.25

## Question 29

df의 item_name 컬럼 값중 Chips 포함하는 경우의 데이터를 출력하라

In [126]:
Ans = df.loc[df.item_name.str.contains('Chips')]
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39
6,3,1,Side of Chips,NaN,$1.69,1.69
10,5,1,Chips and Guacamole,NaN,$4.45,4.45
14,7,1,Chips and Guacamole,NaN,$4.45,4.45
...,...,...,...,...,...,...
4596,1826,1,Chips and Guacamole,NaN,$4.45,4.45
4600,1827,1,Chips and Guacamole,NaN,$4.45,4.45
4605,1828,1,Chips and Guacamole,NaN,$4.45,4.45
4613,1831,1,Chips,NaN,$2.15,2.15
4616,1832,1,Chips and Guacamole,NaN,$4.45,4.45

## Question 30

df의 짝수번째 컬럼만을 포함하는 데이터프레임을 출력하라

In [127]:
Ans = df.iloc[:,::2]
Ans

      order_id                              item_name item_price
0            1           Chips and Fresh Tomato Salsa     $2.39
1            1                                   Izze     $3.39
2            1                       Nantucket Nectar     $3.39
3            1  Chips and Tomatillo-Green Chili Salsa     $2.39
4            2                           Chicken Bowl    $16.98
...        ...                                    ...        ...
4617      1833                          Steak Burrito    $11.75
4618      1833                          Steak Burrito    $11.75
4619      1834                     Chicken Salad Bowl    $11.25
4620      1834                     Chicken Salad Bowl     $8.75
4621      1834                     Chicken Salad Bowl     $8.75

[4622 rows x 3 columns]

## Question 31

df의 new_price 컬럼 값에 따라 내림차순으로 정리하고 index를 초기화 하여라

In [128]:
Ans = df.sort_values('new_price',ascending=False).reset_index(drop=True)
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
0,1443,15,Chips and Fresh Tomato Salsa,NaN,$44.25,44.25
1,1398,3,Carnitas Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$35.25,35.25
2,511,4,Chicken Burrito,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$35.00,35.00
3,1443,4,Chicken Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$35.00,35.00
4,1443,3,Veggie Burrito,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$33.75,33.75
...,...,...,...,...,...,...
4617,1578,1,Canned Soda,[Diet Dr. Pepper],$1.09,1.09
4618,1162,1,Bottled Water,NaN,$1.09,1.09
4619,567,1,Canned Soda,[Coca Cola],$1.09,1.09
4620,1014,1,Canned Soda,[Coca Cola],$1.09,1.09
4621,591,1,Canned Soda,[Sprite],$1.09,1.09

## Question 32

df의 item_name 컬럼 값이 Steak Salad 또는 Bowl 인 데이터를 인덱싱하라

In [129]:
Ans = df.loc[(df.item_name =='Steak Salad') | (df.item_name =='Bowl')]
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
445,193,3,Bowl,"[Braised Carnitas, Pinto Beans, [Sour Cream, C...",$22.20,22.20
664,276,1,Steak Salad,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.99,8.99
673,279,1,Bowl,"[Adobo-Marinated and Grilled Steak, [Sour Crea...",$7.40,7.40
752,311,1,Steak Salad,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.99,8.99
893,369,1,Steak Salad,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$8.99,8.99
3502,1406,1,Steak Salad,"[[Lettuce, Fajita Veggies]]",$8.69,8.69

## Question 33

df의 item_name 컬럼 값이 Steak Salad 또는 Bowl 인 데이터를 데이터 프레임화 한 후, item_name를 기준으로 중복행이 있으면 제거하되 첫번째 케이스만 남겨라

In [130]:
[df.item_name =='Steak Salad']

[0       False
 1       False
 2       False
 3       False
 4       False
         ...
 4617    False
 4618    False
 4619    False
 4620    False
 4621    False
 Name: item_name, Length: 4622, dtype: bool]

In [131]:
df[(df.item_name =='Steak Salad')]

,order_id,quantity,item_name,choice_description,item_price,new_price
664,276,1,Steak Salad,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.99,8.99
752,311,1,Steak Salad,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.99,8.99
893,369,1,Steak Salad,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$8.99,8.99
3502,1406,1,Steak Salad,"[[Lettuce, Fajita Veggies]]",$8.69,8.69

In [132]:
df[(df.item_name =='Steak Salad') | (df.item_name =='Bowl')]

,order_id,quantity,item_name,choice_description,item_price,new_price
445,193,3,Bowl,"[Braised Carnitas, Pinto Beans, [Sour Cream, C...",$22.20,22.20
664,276,1,Steak Salad,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.99,8.99
673,279,1,Bowl,"[Adobo-Marinated and Grilled Steak, [Sour Crea...",$7.40,7.40
752,311,1,Steak Salad,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.99,8.99
893,369,1,Steak Salad,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$8.99,8.99
3502,1406,1,Steak Salad,"[[Lettuce, Fajita Veggies]]",$8.69,8.69

In [133]:
Ans = df.loc[(df.item_name =='Steak Salad') | (df.item_name =='Bowl')]
Ans = Ans.drop_duplicates('item_name')
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
445,193,3,Bowl,"[Braised Carnitas, Pinto Beans, [Sour Cream, C...",$22.20,22.20
664,276,1,Steak Salad,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.99,8.99

## Question 34

df의 item_name 컬럼 값이 Steak Salad 또는 Bowl 인 데이터를 데이터 프레임화 한 후, item_name를 기준으로 중복행이 있으면 제거하되 마지막 케이스만 남겨라

In [134]:
df.loc[(df.item_name =='Steak Salad') | (df.item_name =='Bowl')]

,order_id,quantity,item_name,choice_description,item_price,new_price
445,193,3,Bowl,"[Braised Carnitas, Pinto Beans, [Sour Cream, C...",$22.20,22.20
664,276,1,Steak Salad,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.99,8.99
673,279,1,Bowl,"[Adobo-Marinated and Grilled Steak, [Sour Crea...",$7.40,7.40
752,311,1,Steak Salad,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.99,8.99
893,369,1,Steak Salad,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$8.99,8.99
3502,1406,1,Steak Salad,"[[Lettuce, Fajita Veggies]]",$8.69,8.69

In [135]:
Ans = df.loc[(df.item_name =='Steak Salad') | (df.item_name =='Bowl')]
Ans = Ans.drop_duplicates('item_name',keep='last')
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
673,279,1,Bowl,"[Adobo-Marinated and Grilled Steak, [Sour Crea...",$7.40,7.40
3502,1406,1,Steak Salad,"[[Lettuce, Fajita Veggies]]",$8.69,8.69

## Question 36

df의 데이터 중 item_name의 값이 Izze 데이터를 Fizzy Lizzy로 수정하라

In [136]:
df[df['item_name'] =='Izze']

      order_id  quantity item_name choice_description item_price  new_price
1            1         1      Izze       [Clementine]     $3.39        3.39
24          12         1      Izze       [Grapefruit]     $3.39        3.39
47          21         1      Izze       [Blackberry]     $3.39        3.39
66          30         1      Izze       [Blackberry]     $3.39        3.39
359        155         1      Izze       [Blackberry]     $3.39        3.39
360        155         1      Izze       [Grapefruit]     $3.39        3.39
430        186         1      Izze       [Grapefruit]     $3.39        3.39
579        237         1      Izze       [Clementine]     $3.39        3.39
580        237         1      Izze       [Grapefruit]     $3.39        3.39
1059       436         1      Izze       [Clementine]     $3.39        3.39
1213       495         1      Izze       [Clementine]     $3.39        3.39
1611       651         1      Izze       [Blackberry]     $3.39        3.39
1612       651         1      Izze       [Blackberry]     $3.39        3.39
1680       680         1      Izze       [Clementine]     $3.39        3.39
2088       842         1      Izze       [Clementine]     $3.39        3.39
2619      1040         1      Izze       [Clementine]     $3.39        3.39
2634      1046         1      Izze       [Clementine]     $3.39        3.39
2758      1095         1      Izze       [Blackberry]     $3.39        3.39
2891      1149         1      Izze       [Blackberry]     $3.39        3.39
3669      1468         1      Izze       [Blackberry]     $3.39        3.39

In [137]:
df.loc[df.item_name =='Izze','item_name'] = 'Fizzy Lizzy'
Ans = df
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39
1,1,1,Fizzy Lizzy,[Clementine],$3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98
...,...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75,11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75,11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25,11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75

In [138]:
df[df['item_name'] =='Fizzy Lizzy']

      order_id  quantity    item_name choice_description item_price  new_price
1            1         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
24          12         1  Fizzy Lizzy       [Grapefruit]     $3.39        3.39
47          21         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
66          30         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
359        155         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
360        155         1  Fizzy Lizzy       [Grapefruit]     $3.39        3.39
430        186         1  Fizzy Lizzy       [Grapefruit]     $3.39        3.39
579        237         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
580        237         1  Fizzy Lizzy       [Grapefruit]     $3.39        3.39
1059       436         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
1213       495         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
1611       651         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
1612       651         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
1680       680         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
2088       842         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
2619      1040         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
2634      1046         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
2758      1095         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
2891      1149         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
3669      1468         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39

## Question 37

df의 데이터 중 choice_description 값이 NaN 인 데이터의 갯수를 구하여라

In [139]:
Ans = df.choice_description.isnull().sum()
Ans

1246

## Question 38

df의 데이터 중 choice_description 값이 NaN 인 데이터를 NoData 값으로 대체하라(loc 이용)

In [140]:
df.loc[df.choice_description.isnull(),'choice_description'] ='NoData'
Ans = df
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
0,1,1,Chips and Fresh Tomato Salsa,NoData,$2.39,2.39
1,1,1,Fizzy Lizzy,[Clementine],$3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NoData,$2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98
...,...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75,11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75,11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25,11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75

## Question 39

df의 데이터 중 choice_description 값에 Black이 들어가는 경우를 인덱싱하라

In [141]:
Ans = df[df.choice_description.str.contains('Black')]
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75,11.75
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25,9.25
11,6,1,Chicken Crispy Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75,8.75
12,6,1,Chicken Soft Tacos,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",$8.75,8.75
...,...,...,...,...,...,...
4604,1828,1,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$8.75,8.75
4608,1829,1,Veggie Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.25,11.25
4611,1830,1,Veggie Burrito,"[Tomatillo Green Chili Salsa, [Rice, Fajita Ve...",$11.25,11.25
4612,1831,1,Carnitas Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$9.25,9.25
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75,11.75

## Question 40

df의 데이터 중 choice_description 값에 Vegetables 들어가지 않는 경우의 갯수를 출력하라

In [142]:
df['choice_description'].str.contains('Vegetables')

0       False
1       False
2       False
3       False
4       False
        ...
4617    False
4618    False
4619     True
4620     True
4621     True
Name: choice_description, Length: 4622, dtype: bool

In [143]:
~df['choice_description'].str.contains('Vegetables')

0        True
1        True
2        True
3        True
4        True
        ...
4617     True
4618     True
4619    False
4620    False
4621    False
Name: choice_description, Length: 4622, dtype: bool

In [144]:
Ans = len(df.loc[~df.choice_description.str.contains('Vegetables')])
Ans

3900

## Question 41

df의 데이터 중 item_name 값이 N으로 시작하는 데이터를 모두 추출하라

In [145]:
df.item_name

0                Chips and Fresh Tomato Salsa
1                                 Fizzy Lizzy
2                            Nantucket Nectar
3       Chips and Tomatillo-Green Chili Salsa
4                                Chicken Bowl
                        ...
4617                            Steak Burrito
4618                            Steak Burrito
4619                       Chicken Salad Bowl
4620                       Chicken Salad Bowl
4621                       Chicken Salad Bowl
Name: item_name, Length: 4622, dtype: object

In [146]:
df['item_name']

0                Chips and Fresh Tomato Salsa
1                                 Fizzy Lizzy
2                            Nantucket Nectar
3       Chips and Tomatillo-Green Chili Salsa
4                                Chicken Bowl
                        ...
4617                            Steak Burrito
4618                            Steak Burrito
4619                       Chicken Salad Bowl
4620                       Chicken Salad Bowl
4621                       Chicken Salad Bowl
Name: item_name, Length: 4622, dtype: object

In [147]:
df['item_name'][0]

'Chips and Fresh Tomato Salsa'

In [148]:
df['item_name'].str[0]

0       C
1       F
2       N
3       C
4       C
       ..
4617    S
4618    S
4619    C
4620    C
4621    C
Name: item_name, Length: 4622, dtype: object

In [149]:
df['item_name'].str[0] == 'N'

0       False
1       False
2        True
3       False
4       False
        ...
4617    False
4618    False
4619    False
4620    False
4621    False
Name: item_name, Length: 4622, dtype: bool

In [150]:
df[df['item_name'].str[0] == 'N']

,order_id,quantity,item_name,choice_description,item_price,new_price
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
22,11,1,Nantucket Nectar,[Pomegranate Cherry],$3.39,3.39
105,46,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
173,77,1,Nantucket Nectar,[Apple],$3.39,3.39
205,91,1,Nantucket Nectar,[Peach Orange],$3.39,3.39
436,189,1,Nantucket Nectar,[Pomegranate Cherry],$3.39,3.39
601,247,2,Nantucket Nectar,[Pineapple Orange Banana],$6.78,6.78
925,381,1,Nantucket Nectar,[Pomegranate Cherry],$3.39,3.39
1356,553,1,Nantucket Nectar,[Pomegranate Cherry],$3.39,3.39
1585,641,1,Nantucket Nectar,[Peach Orange],$3.39,3.39
1626,656,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
1706,690,1,Nantucket Nectar,[Apple],$3.39,3.39
2162,872,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
2379,947,2,Nantucket Nectar,[Peach Orange],$6.78,6.78
2381,947,1,Nantucket Nectar,[Apple],$3.39,3.39
2430,965,1,Nantucket Nectar,[Pomegranate Cherry],$3.39,3.39
2653,1053,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
2818,1118,1,Nantucket Nectar,[Apple],$3.39,3.39
2838,1128,1,Nantucket Nectar,[Peach Orange],$3.39,3.39
2853,1133,1,Nantucket Nectar,[Apple],$3.39,3.39
2949,1172,1,Nantucket Nectar,[Peach Orange],$3.39,3.39
3318,1330,1,Nantucket Nectar,[Peach Orange],$3.39,3.39
3368,1351,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
3570,1433,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
3845,1541,1,Nantucket Nectar,[Peach Orange],$3.39,3.39
4019,1609,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
4078,1632,1,Nantucket Nectar,[Peach Orange],$3.39,3.39

In [151]:
Ans = df[df.item_name.str.startswith('N')]
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
22,11,1,Nantucket Nectar,[Pomegranate Cherry],$3.39,3.39
105,46,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
173,77,1,Nantucket Nectar,[Apple],$3.39,3.39
205,91,1,Nantucket Nectar,[Peach Orange],$3.39,3.39
436,189,1,Nantucket Nectar,[Pomegranate Cherry],$3.39,3.39
601,247,2,Nantucket Nectar,[Pineapple Orange Banana],$6.78,6.78
925,381,1,Nantucket Nectar,[Pomegranate Cherry],$3.39,3.39
1356,553,1,Nantucket Nectar,[Pomegranate Cherry],$3.39,3.39
1585,641,1,Nantucket Nectar,[Peach Orange],$3.39,3.39
1626,656,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
1706,690,1,Nantucket Nectar,[Apple],$3.39,3.39
2162,872,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
2379,947,2,Nantucket Nectar,[Peach Orange],$6.78,6.78
2381,947,1,Nantucket Nectar,[Apple],$3.39,3.39
2430,965,1,Nantucket Nectar,[Pomegranate Cherry],$3.39,3.39
2653,1053,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
2818,1118,1,Nantucket Nectar,[Apple],$3.39,3.39
2838,1128,1,Nantucket Nectar,[Peach Orange],$3.39,3.39
2853,1133,1,Nantucket Nectar,[Apple],$3.39,3.39
2949,1172,1,Nantucket Nectar,[Peach Orange],$3.39,3.39
3318,1330,1,Nantucket Nectar,[Peach Orange],$3.39,3.39
3368,1351,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
3570,1433,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
3845,1541,1,Nantucket Nectar,[Peach Orange],$3.39,3.39
4019,1609,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39,3.39
4078,1632,1,Nantucket Nectar,[Peach Orange],$3.39,3.39

## Question 42

df의 데이터 중 띄어쓰기 포함 item_name 값의 단어갯수가 15개 이상인 데이터를 인덱싱하라

In [152]:
a = 'abc d e f'
len(a)

9

In [153]:
Ans= df[df.item_name.str.len() >=15]
Ans

,order_id,quantity,item_name,choice_description,item_price,new_price
0,1,1,Chips and Fresh Tomato Salsa,NoData,$2.39,2.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NoData,$2.39,2.39
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25,9.25
10,5,1,Chips and Guacamole,NoData,$4.45,4.45
...,...,...,...,...,...,...
4615,1832,1,Chicken Soft Tacos,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream]]",$8.75,8.75
4616,1832,1,Chips and Guacamole,NoData,$4.45,4.45
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25,11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75